app/Controllers/Buku.php

SELECT *
FROM `buku`
 LIMIT 4, 4
SELECT COUNT(*) AS `numrows`
FROM `buku`
---
    public function index()
    {
        $keyword = $this->request->getGet('keyword');

        if ($keyword) {
            $buku = $this->bukuModel->search($keyword)->paginate(4);
        } else {
            $buku = $this->bukuModel->paginate(4);

INSERT INTO `buku` (`judul`, `penulis`, `penerbit`, `tahun`, `sinopsis`, `cover`) VALUES ('Buku Sakti Pemrogaman Web: HTML, CSS, PHP, MYSQL & Javascript', 'Didik Setiawan', 'Start Up', '2018', '“Buku Sakti Pemrogaman Web: HTML, CSS, PHP, MYSQL & Javascript” membahas mengenai serba-serbi pemrograman web, mulai dari HTML, CSS, PHP, Javascript dan Jquery, hingga bagaimana membuat web sederhana.\r\n\r\nPenjelasan materi dalam “Buku Sakti Pemrogaman Web: HTML, CSS, PHP, MYSQL & Javascript” lengkap dan dimulai dengan dasar-dasarnya, sehingga buku ini dapat dijadikan bahan bacaan bagi para pemula yang baru menyelami dunia pemrograman web.', '1753590343_ce82a08f4e4578ef363e.jpg')
---
    public function store()
    {
        $file = $this->request->getFile('cover');
        $coverName = null;

        if ($file && $file->isValid() && !$file->hasMoved()) {
            $coverName = $file->getRandomName();
            $file->move(FCPATH . 'uploads/', $coverName);
        }

        $this->bukuModel->save([
            'judul'    => $this->request->getPost('judul'),
            'penulis'  => $this->request->getPost('penulis'),
            'penerbit' => $this->request->getPost('penerbit'),
            'tahun'    => $this->request->getPost('tahun'),
            'sinopsis' => $this->request->getPost('sinopsis'),
            'cover'    => $coverName,
        ]);

SELECT *
FROM `buku`
WHERE `buku`.`id` = '7'
---
    public function edit($id)
    {
        $data['buku'] = $this->bukuModel->find($id);

SELECT *
FROM `buku`
WHERE `buku`.`id` = '7'
---
    public function update($id)
    {
        $buku = $this->bukuModel->find($id);

UPDATE `buku` SET `judul` = 'Buku Sakti Pemrogaman Web: HTML, CSS, PHP, MYSQL & Javascript', `penulis` = 'Didik Setiawan', `penerbit` = 'Start Up', `tahun` = '2019', `sinopsis` = '“Buku Sakti Pemrogaman Web: HTML, CSS, PHP, MYSQL & Javascript” membahas mengenai serba-serbi pemrograman web, mulai dari HTML, CSS, PHP, Javascript dan Jquery, hingga bagaimana membuat web sederhana.\r\n\r\nPenjelasan materi dalam “Buku Sakti Pemrogaman Web: HTML, CSS, PHP, MYSQL & Javascript” lengkap dan dimulai dengan dasar-dasarnya, sehingga buku ini dapat dijadikan bahan bacaan bagi para pemula yang baru menyelami dunia pemrograman web.', `cover` = '1753590368_42a2af08dce38ce61a6b.jpg'
WHERE `buku`.`id` IN ('7')
---
            $data['cover'] = $newName;
        }

        $this->bukuModel->update($id, $data);